import numpy as np

def mnk(V):
    N = len(V)

    M = np.sum(V) / N

    D = 0

    for R in V:
        D += (R - M) ** 2

    D = np.sqrt(D / N / (N - 1))

    return M, D


A = [15.79, 15.80, 15.79, 15.80, 15.79]

B = [15.81, 15.85, 15.85, 15.86, 15.88]

C = [15.92, 15.90, 15.94, 15.94, 15.91]

D = [16.33, 16.22, 16.16, 16.30, 16.30]

E = [16.52, 16.52, 16.54, 16.47, 16.53]

F = [16.62, 16.81, 16.73, 16.87, 16.81]

G = [17.22, 17.21, 17.21, 17.25, 17.21]


res = mnk(A)

res1 = mnk(B)

res2 = mnk(C)

res3 = mnk(D)

res4 = mnk(E)

res5 = mnk(F)

res6 = mnk(G)

print('среднее арифм. = %f, ср.кв.откл. = %f' % res)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res1)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res2)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res3)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res4)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res5)
print('среднее арифм. = %f, ср.кв.откл. = %f' % res6)